config.org
#+TITLE: GNU Emacs Config
#+AUTHOR: Karna
#+auto_tangle: t
#+DESCRIPTION: My personal Emacs config.
#+STARTUP: showeverything
#+OPTIONS: toc:3

* TABLE OF CONTENTS :toc:
- [[#package-manager-setup][PACKAGE MANAGER SETUP]]
- [[#core-configuration][CORE CONFIGURATION]]
  - [[#hooks--cache][HOOKS & CACHE]]
  - [[#ui-tweaks][UI TWEAKS]]
  - [[#garbage-collection][GARBAGE COLLECTION]]
  - [[#native-compile][NATIVE COMPILE]]
  - [[#byte-compilation][BYTE COMPILATION]]
  - [[#async][ASYNC]]
- [[#editor-settings][EDITOR SETTINGS]]
  - [[#custom][CUSTOM]]
  - [[#backup-settings][BACKUP SETTINGS]]
  - [[#format-all][FORMAT ALL]]
  - [[#undo-fu][UNDO FU]]
  - [[#jarchive][JARCHIVE]]
  - [[#breadcrumb][BREADCRUMB]]
  - [[#diminish][DIMINISH]]
  - [[#rainbow-mode][RAINBOW MODE]]
  - [[#rainbow-delimiters][RAINBOW DELIMITERS]]
  - [[#drag-stuff][DRAG-STUFF]]
  - [[#some-extra-stuff][SOME EXTRA STUFF]]
  - [[#highlight-indentation-guides][HIGHLIGHT INDENTATION GUIDES]]
  - [[#flycheck][FLYCHECK]]
  - [[#wakatime][WAKATIME]]
- [[#load-evil-mode][LOAD EVIL MODE]]
- [[#which-key][WHICH KEY]]
- [[#ui-configurations][UI CONFIGURATIONS]]
  - [[#themes][THEMES]]
  - [[#fonts][FONTS]]
  - [[#icons][ICONS]]
  - [[#beacon][BEACON]]
- [[#dashboard][DASHBOARD]]
- [[#modeline][MODELINE]]
- [[#projectile][PROJECTILE]]
- [[#perspective][PERSPECTIVE]]
- [[#minibuffer][MINIBUFFER]]
  - [[#vertico][Vertico]]
  - [[#marginalia][Marginalia]]
  - [[#embark][Embark]]
  - [[#archives][ARCHIVES]]
- [[#consult][Consult]]
- [[#completions][COMPLETIONS]]
  - [[#corfu][CORFU]]
  - [[#cape][CAPE]]
  - [[#orderless-smart-matching-for-completions][Orderless (Smart Matching for Completions)]]
  - [[#tabnine][TABNINE]]
  - [[#yasnippet][YASNIPPET]]
  - [[#consult-yasnippet][CONSULT YASNIPPET]]
  - [[#archives-1][ARCHIVES]]
- [[#git-programs][GIT PROGRAMS]]
  - [[#git-time-machine][Git Time Machine]]
  - [[#magit][Magit]]
  - [[#ediff][EDIFF]]
- [[#gptel][GPTEL]]
- [[#ellama][ELLAMA]]
- [[#calc][CALC]]
- [[#file-manager-and-buffers-setup][FILE MANAGER AND BUFFERS SETUP]]
  - [[#treemacs][TREEMACS]]
  - [[#dired][DIRED]]
  - [[#peep-dired][PEEP DIRED]]
  - [[#sudo-edit][SUDO EDIT]]
- [[#development][DEVELOPMENT]]
  - [[#treesitter][TREESITTER]]
  - [[#eglot][EGLOT]]
  - [[#conda][CONDA]]
  - [[#pyenv][PYENV]]
- [[#latex-setup][LATEX SETUP]]
  - [[#pdf-tools][PDF TOOLS]]
  - [[#epub-reader][EPUB READER]]
  - [[#latex-previw-setup--settings][LATEX PREVIW SETUP & SETTINGS]]
  - [[#reftex][REFTEX]]
  - [[#preview-zathura][PREVIEW (ZATHURA)]]
  - [[#citar][CITAR]]
  - [[#auctex-latexmk][AUCTEX-LATEXMK]]
  - [[#magic-latex-buffer][MAGIC LATEX BUFFER]]
  - [[#preview-auto][PREVIEW AUTO]]
  - [[#xenops][Xenops]]
  - [[#archives-2][ARCHIVES]]
- [[#org-latex][ORG LATEX]]
  - [[#latex-compiler--basic-preview-settings][LATEX COMPILER & BASIC PREVIEW SETTINGS]]
  - [[#custom-latex-classes][CUSTOM LATEX CLASSES]]
  - [[#org-latex-preview][ORG LATEX PREVIEW]]
  - [[#citation-and-bibliography-integration][CITATION AND BIBLIOGRAPHY INTEGRATION]]
  - [[#archives-3][ARCHIVES]]
- [[#markdown][MARKDOWN]]
  - [[#markdown-setup][MARKDOWN SETUP]]
  - [[#ox-hugo][OX-HUGO]]
  - [[#markdown-preview-mode][MARKDOWN PREVIEW MODE]]
  - [[#markdown-latex-preview][MARKDOWN LATEX PREVIEW]]
  - [[#archives-4][ARCHIVES]]
  - [[#impatient-mode][IMPATIENT MODE]]
- [[#org-mode][ORG MODE]]
  - [[#settings][SETTINGS]]
  - [[#org-remarks][ORG REMARKS]]
  - [[#highlight-todo][HIGHLIGHT TODO]]
  - [[#org-tempo][Org-Tempo]]
  - [[#center-org-mode][CENTER ORG MODE]]
  - [[#org-auto-tangle][ORG AUTO TANGLE]]
  - [[#org-mermaid][ORG MERMAID]]
  - [[#org-eval][ORG EVAL]]
  - [[#org-definitions][ORG DEFINITIONS]]
  - [[#agenda][AGENDA]]
  - [[#org-roam--journal-configuration][ORG ROAM & JOURNAL CONFIGURATION]]
- [[#shells-and-terminals][SHELLS AND TERMINALS]]
  - [[#eshell][ESHELL]]
  - [[#vterm][VTERM]]
  - [[#vterm-toggle][VTERM TOGGLE]]
  - [[#vterm-multi][VTERM MULTI]]
- [[#calendar][CALENDAR]]
- [[#centaur-tabs][CENTAUR TABS]]
- [[#general-keybindings][GENERAL KEYBINDINGS]]
- [[#load-config-files][LOAD CONFIG FILES]]

* PACKAGE MANAGER SETUP
  I am using [[https://github.com/progfolio/elpaca][Elpaca]] as my package manager which is very fast and asynchronous package manager.

#+BEGIN_SRC emacs-lisp :tangle lisp/elpaca.el
;;; elpaca.el --- Package Manager Setup -*- lexical-binding: t; -*-

(defvar elpaca-installer-version 0.9)
(defvar elpaca-directory (expand-file-name "elpaca/" "~/.local/share/git/"))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
			      :ref nil :depth 1 :inherit ignore
			      :files (:defaults "elpaca-test.el" (:exclude "extensions"))
			      :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
	(if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
		  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
						  ,@(when-let* ((depth (plist-get order :depth)))
						      (list (format "--depth=%d" depth) "--no-single-branch"))
						  ,(plist-get order :repo) ,repo))))
		  ((zerop (call-process "git" nil buffer t "checkout"
					(or (plist-get order :ref) "--"))))
		  (emacs (concat invocation-directory invocation-name))
		  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
					"--eval" "(byte-recompile-directory \".\" 0 'force)")))
		  ((require 'elpaca))
		  ((elpaca-generate-autoloads "elpaca" repo)))
	    (progn (message "%s" (buffer-string)) (kill-buffer buffer))
	  (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

;; Install use-package support
(elpaca elpaca-use-package
  ;; Enable :elpaca use-package keyword.
  (elpaca-use-package-mode)
  ;; Assume :elpaca t unless otherwise specified.
  (setq elpaca-use-package-by-default t))

;; Block until current queue processed.
(elpaca-wait)

;;When installing a package which modifies a form used at the top-level
;;(e.g. a package which adds a use-package key word),
;;use `elpaca-wait' to block until that package has been installed/configured.
;;For example:
;;(use-package general :demand t)
;;(elpaca-wait)

;;Turns off elpaca-use-package-mode current declartion
;;Note this will cause the declaration to be interpreted immediately (not deferred).
;;Useful for configuring built-in emacs features.
;;(use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

;; Don't install anything. Defer execution of BODY
;;(elpaca nil (message "deferred"))


(provide 'elpaca-setup)
;;; elpaca-setup.el ends here
#+END_SRC

-----

* CORE CONFIGURATION
  Core configurations such as UI tweakings, hooks, directories, garbage management, etc.

** HOOKS & CACHE
   Adding some startup hooks and changing the cache directories for some modes in Emacs.

#+BEGIN_SRC emacs-lisp :tangle lisp/hooks-dirs.el
;;; hooks-dirs.el --- Hooks and Cache Dirs Settings -*- lexical-binding: t; -*-

(add-hook 'after-init-hook #'global-auto-revert-mode)  ;; Automatically refresh buffers
(add-hook 'after-init-hook #'recentf-mode)             ;; Track recently opened files
(add-hook 'after-init-hook #'savehist-mode)            ;; Preserve minibuffer history
(add-hook 'after-init-hook #'save-place-mode)          ;; Remember cursor positions

;;----------------------------------------------------------------------------
;; Custom Directories for Cache Files
;;----------------------------------------------------------------------------

(defun dir-concat (dir file)
  (concat (file-name-as-directory dir) file))

;; Define the cache directory for Emacs files.
(defvar user-cache-directory "~/.cache/emacs/"
  "Directory for files created by Emacs.")

;; Set the file to save cursor positions.
(setq save-place-file (dir-concat user-cache-directory "places"))
;; Set the file for transient history.
(setq transient-history-file (dir-concat user-cache-directory "transient-history.el"))
;; Set the file for bookmarks.
(setq bookmark-default-file (dir-concat user-emacs-directory ".cache/bookmarks"))
;; Set the prefix for auto-save list files.
(setq auto-save-list-file-prefix (dir-concat user-cache-directory "auto-save-list/.saves-"))
;; Set the file for save history.
(setq savehist-file (dir-concat user-cache-directory "savehist"))
;; Set the file for TRAMP persistency.
(setq tramp-persistency-file-name (dir-concat user-cache-directory "tramp"))
;; Set the file for the LSP session.
(setq lsp-session-file (dir-concat user-cache-directory "lsp-session"))
;; Set the file for DAP breakpoints.
(setq dap-breakpoints-file (dir-concat user-cache-directory "dap-breakpoints"))
;; Set the file for Projectile's known projects.
(setq projectile-known-projects-file (dir-concat user-emacs-directory ".cache/projectile-bookmarks.eld"))
;; Set the directory for eshell.
(setq eshell-directory-name (dir-concat user-cache-directory "eshell"))
;; Set the file for eshell history.
(setq eshell-history-file-name (dir-concat user-cache-directory "eshell-history"))
;; Set the file for eshell's last directory ring.
(setq eshell-last-dir-ring-file-name (dir-concat user-cache-directory "eshell-last-dir-ring"))
;; Set the directory for undo session files.
(setq undo-fu-session-directory (dir-concat user-cache-directory "undo-fu-session/"))
;; Set the file for perspective sessions.
(setq persp-state-default-file (dir-concat user-emacs-directory ".cache/sessions"))
;; Set the file for org-id locations.
(setq org-id-locations-file (concat user-emacs-directory ".cache/.org-id-locations"))
;; Set the file for org-roam database.
(setq org-roam-db-location "/mnt/Karna/Git/Project-K/Org/Roam/org-roam.db")
;; Set the preview tailor storage file.
(setq preview-tailor-storage-file (dir-concat user-cache-directory ".preview-tailor"))

(provide 'hooks-dirs)
;;; hooks-dirs.el ends here
#+END_SRC

