lisp/core-config.el
;; Asynchronous Process
;;----------------------------------------------------------------------------

(use-package async
  :ensure t
  :defer t
  :init (dired-async-mode 1))


(provide 'core-config)
;;; core-config.el ends here
