lisp/editor.el
;;; custom.el --- Custom Settings for Emacs -*- lexical-binding: t; -*-

;; Set the default browser function and program
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "zen-browser"
      browse-url-default-program "zen-browser")

;; Specify browser for Org mode HTML export (optional)
(setq org-html-htmlize-browser "zen-browser")

;; Configure file associations for Org mode
(setq org-file-apps
      '(("auto-mode" . emacs)          ;; Open files in Emacs by default
	("\\.mm\\'" . default)         ;; Use system default for .mm files
	("\\.x?html?\\'" . "zen-browser %s")  ;; Open HTML files in zen-browser
	("\\.pdf\\'" . "~/.local/bin/zathura %s"))) ;; Open PDFs in Zathura

;; Set default system file opener using xdg-open
(setcdr (assq 'system org-file-apps-gnu) "xdg-open %s")

;; Workaround for a known issue with xdg-open when opening files in Org mode
(advice-add 'org-open-file :around
	    (lambda (orig-fun &rest args)
	      (let ((process-connection-type nil))
		(apply orig-fun args))))

;; ----------------------------------------------------------------------------
;; RECENTF SETTINGS
;; ----------------------------------------------------------------------------

(require 'recentf)

;; Configure recentf settings
(setq recentf-save-file (dir-concat user-cache-directory "recentf")
      recentf-max-saved-items 200    ;; Store up to 200 recent files
      recentf-auto-cleanup 180)      ;; Auto-cleanup old entries every 180 seconds

;; Exclude specific files and directories from tracking
(setq recentf-exclude
      '("~/.cache/emacs/"             ;; Exclude everything inside ~/.cache/emacs/
	"/mnt/Karna/Git/Project-K/Org/Tasks.org" ;; Exclude this specific Org file
	"_region_\\.tex$"              ;; Ignore temporary LaTeX region files
	"^/tmp/"))                     ;; Exclude everything inside /tmp/

;; Enable recentf mode
(recentf-mode 1)

;; ----------------------------------------------------------------------------
;; BACKUP SETTINGS
;; ----------------------------------------------------------------------------

(setq backup-directory-alist '((".*" . "~/.local/share/Trash/files"))) ;; Default to Trash folder

;; Else you can also create a custom backup directory in ~/.cache/emacs and save the files versions wise

;;(setq backup-directory-alist
;;      `(("." . ,(dir-concat user-cache-directory "backup")))
;;      backup-by-copying t ; Use copies
;;      version-control t ; Use version numbers on backups
;;      delete-old-versions t ; Automatically delete excess backups
;;      kept-new-versions 5 ; Newest versions to keep
;;      kept-old-versions 3 ; Old versions to keep
;;      )

;; ----------------------------------------------------------------------------
;; FORMATTING SETTINGS
;; ----------------------------------------------------------------------------

(use-package format-all
  :ensure t
  :defer t
  :preface
  (defun ian/format-code ()
    "Auto-format the entire buffer. If in `prolog-mode', call `prolog-indent-buffer';  if the buffer is managed by Eglot and the LSP server supports document formatting, call `eglot-format-buffer'; otherwise, call `format-all-buffer'."
    (interactive)
    (cond
     ((derived-mode-p 'prolog-mode)
      (prolog-indent-buffer))
     ((and (eglot-managed-p)
	   (eglot--server-capable :documentFormattingProvider))
      (eglot-format-buffer))
     (t (format-all-buffer))))
  :hook (prog-mode . format-all-ensure-formatter))

;; ----------------------------------------------------------------------------
;; UNDO MANAGEMENT
;; ----------------------------------------------------------------------------

;; The `undo-fu` package provides a more intuitive undo system than the default Emacs undo.
(use-package undo-fu
  :ensure t
  :defer t
  :config
  (setq undo-fu-allow-undo-in-region t) ;; Allow undo in active region
  (setq undo-fu-ignore-keyboard-quit t)) ;; Prevent undo from resetting on C-g

;; The `undo-fu-session` package saves and restores undo history across Emacs sessions.
(use-package undo-fu-session
  :ensure t
  :defer t
  :config
  (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
  (setq undo-fu-session-directory (dir-concat user-cache-directory "undo-fu-session/")) ;; Store undo history in cache
  :hook ((prog-mode conf-mode text-mode tex-mode) . undo-fu-session-mode))

;;; JARCHIVE

(use-package jarchive
  :ensure t
  :after eglot
  :config
  (jarchive-setup))

;; ----------------------------------------------------------------------------
;; BREADCRUMB FOR EMACS
;; ----------------------------------------------------------------------------

(use-package breadcrumb
  :ensure t
  :config
  (breadcrumb-mode 1) ; Enable breadcrumb globally.
  ;; Optional tweaks for breadcrumb appearance:
  (setq breadcrumb-imenu-max-length 30
	breadcrumb-project-max-length 30
	breadcrumb-imenu-crumb-separator " » "
	breadcrumb-project-crumb-separator " / ")
  ;; Set the header-line to display both project and imenu breadcrumbs.
  (setq header-line-format
	'((:eval (concat (breadcrumb-project-crumbs)
			 "  " (breadcrumb-imenu-crumbs))))))

;; ----------------------------------------------------------------------------
;; DIMINISH
;; ----------------------------------------------------------------------------

(use-package diminish
  :ensure t
  :defer t
  :init
  (diminish 'visual-line-mode)
  (diminish 'subword-mode)
  (diminish 'beacon-mode)
  (diminish 'irony-mode)
  (diminish 'page-break-lines-mode)
  (diminish 'rainbow-delimiters-mode)
  (diminish 'auto-revert-mode)
  (diminish 'yas-minor-mode)
)

;; ----------------------------------------------------------------------------
;; RAINBOW MODE
;; ----------------------------------------------------------------------------

(use-package rainbow-mode
  :ensure t
  :defer t
  :diminish
  :hook org-mode prog-mode)

;; ----------------------------------------------------------------------------
;; RAINBOW DELIMITERS
;; ----------------------------------------------------------------------------

(use-package rainbow-delimiters
  :ensure t
  :defer t
  :hook ((emacs-lisp-mode . rainbow-delimiters-mode)
	 (clojure-mode . rainbow-delimiters-mode)))

;; ----------------------------------------------------------------------------
;; DRAG STUFF
;; ----------------------------------------------------------------------------
