config.org
** DRAG-STUFF
[[https://github.com/rejeep/drag-stuff.el][Drag Stuff]] is a minor mode for Emacs that makes it possible to drag stuff (words, region, lines) around in Emacs.  When 'drag-stuff-define-keys' is enabled, then the following keybindings are set: M-up, M-down, M-left, and M-right.

#+BEGIN_SRC emacs-lisp :tangle lisp/editor.el
;; ----------------------------------------------------------------------------
;; DRAG STUFF
;; ----------------------------------------------------------------------------

(use-package drag-stuff
  :ensure t
  :defer t
  :diminish
  :init
  (drag-stuff-global-mode 1)
  (drag-stuff-define-keys))


#+END_SRC

** SOME EXTRA STUFF
I am so lazy to document so adding some of the extras here

#+BEGIN_SRC emacs-lisp :tangle lisp/editor.el
;; ----------------------------------------------------------------------------
;; SOME EXTRA STUFF
;; ----------------------------------------------------------------------------

(use-package tldr :ensure t :defer t)

;; Use puni-mode globally and disable it for term-mode.
(use-package puni
  :defer t
  :init
  ;; The autoloads of Puni are set up so you can enable `puni-mode` or
  ;; `puni-global-mode` before `puni` is actually loaded. Only after you press
  ;; any key that calls Puni commands, it's loaded.
  (puni-global-mode)
  (add-hook 'term-mode-hook #'puni-disable-puni-mode))

(use-package expand-region
  :bind ("C-=" . er/expand-region))

;; Removes whitespace from the ends of lines.
(use-package ws-butler
:init (ws-butler-global-mode))


#+END_SRC

** HIGHLIGHT INDENTATION GUIDES

#+BEGIN_SRC emacs-lisp :tangle lisp/editor.el
;; ----------------------------------------------------------------------------
;; HIGHLIGHT INDENTATION GUIDES
;; ----------------------------------------------------------------------------

(use-package highlight-indent-guides
  :ensure t
  :defer t
  :hook (prog-mode . highlight-indent-guides-mode)
  :config
  (setq highlight-indent-guides-method 'character)
  (setq highlight-indent-guides-character ?\|)
  (setq highlight-indent-guides-responsive 'top)
  (setq highlight-indent-guides-auto-enabled nil) ;; Disable auto coloring

  ;; Adjust colors based on theme background
  (defun my/highlight-indent-guides-set-colors ()
    (if (eq (frame-parameter nil 'background-mode) 'dark)
	(progn
	  (set-face-foreground 'highlight-indent-guides-character-face "gray40")
	  (set-face-foreground 'highlight-indent-guides-top-character-face "white")
	  (set-face-foreground 'highlight-indent-guides-stack-character-face "gray60"))
      (progn
	(set-face-foreground 'highlight-indent-guides-character-face "gray40")
	(set-face-foreground 'highlight-indent-guides-top-character-face "black")
	(set-face-foreground 'highlight-indent-guides-stack-character-face "gray60"))))

  (add-hook 'after-load-theme-hook #'my/highlight-indent-guides-set-colors)
  (my/highlight-indent-guides-set-colors)) ;; Apply colors immediately


#+END_SRC

** FLYCHECK
Install =luacheck= from your Linux distro's repositories for flycheck to work correctly with lua files.  Install =python-pylint= for flycheck to work with python files.  Haskell works with flycheck as long as =haskell-ghc= or =haskell-stack-ghc= is installed.  For more information on language support for flycheck, [[https://www.flycheck.org/en/latest/languages.html][read this]].

#+BEGIN_SRC emacs-lisp :tangle lisp/editor.el
;; ----------------------------------------------------------------------------
;; FLYCHECK FOR EMACS
;; ----------------------------------------------------------------------------

(use-package flycheck
  :ensure t
  :defer t
  :diminish flycheck-mode
  :init
  (global-flycheck-mode)
  :config
  ;; Adjust when Flycheck runs syntax checks.
  (setq flycheck-check-syntax-automatically '(save idle-change mode-enabled)
	;; Increase the error threshold to avoid disabling checkers on too many errors.
	flycheck-checker-error-threshold 1000))

(use-package sideline-flymake
  :hook (flymake-mode . sideline-mode)
  :custom
  (sideline-flymake-display-mode 'line) ;; show errors on the current line
  (sideline-backends-right '(sideline-flymake)))


(provide 'editor)
;;; editor.el ends here
#+END_SRC

** WAKATIME
Wakatime is a time tracking extension for Emacs.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/wakatime.el
;;; wakatime.el --- Wakatime Extension -*- lexical-binding: t; -*-

(use-package wakatime-mode
  :ensure t
  :diminish
  :config
  (global-wakatime-mode)) ;; Requires wakatime-cli


(provide 'packages/wakatime)
;; packages/wakatime.el ends here
#+END_SRC

-----

* LOAD EVIL MODE
[[https://github.com/emacs-evil/evil][Evil]] is an extensible vi/vim layer for Emacs. Because...let's face it. The Vim keybindings are just plain better.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/evil.el
;;; evil.el --- Evil Mode Setup -*- lexical-binding: t; -*-

;; Expands to: (elpaca evil (use-package evil :demand t))
(use-package evil
  :diminish
  :ensure t
  :init      ;; tweak evil's configuration before loading it
  (setq evil-want-integration t  ;; This is optional since it's already set to t by default.
	evil-want-keybinding nil
	evil-vsplit-window-right t
	evil-split-window-below t
	evil-undo-system 'undo-redo)  ;; Adds vim-like C-r redo functionality
  (evil-mode 1))

(use-package evil-collection
  :diminish
  :after evil
  :config
  ;; Do not uncomment this unless you want to specify each and every mode
  ;; that evil-collection should works with.  The following line is here
  ;; for documentation purposes in case you need it.
  ;; (setq evil-collection-mode-list '(calendar dashboard dired ediff info magit ibuffer))
  (add-to-list 'evil-collection-mode-list 'help) ;; evilify help mode
  (evil-collection-init))

(use-package evil-tutor :diminish)

;; Using RETURN to follow links in Org/Evil
;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "TAB") nil))
;; Setting RETURN key in org-mode to follow links
  (setq org-return-follows-link  t)

(use-package evil-tex
  :ensure t
  :hook (LaTeX-mode . evil-tex-mode))


#+END_SRC

* WHICH KEY
Which Key is a minor mode for Emacs that displays the key bindings following your currently entered incomplete command (a prefix) in a popup

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/evil.el
;; ----------------------------------------------------------------------------
;; WHICH KEY
;; ----------------------------------------------------------------------------

(use-package which-key
  :init
    (which-key-mode 1)
  :diminish
  :config
  (setq which-key-side-window-location 'bottom
    which-key-sort-order #'which-key-key-order-alpha
    which-key-allow-imprecise-window-fit nil
    which-key-sort-uppercase-first nil
    which-key-add-column-padding 1
    which-key-max-display-columns nil
    which-key-min-display-lines 6
    which-key-side-window-slot -10
    which-key-side-window-max-height 0.25
    which-key-idle-delay 0.8
    which-key-max-description-length 25
    which-key-allow-imprecise-window-fit nil
    which-key-separator " → " ))


(provide 'packages/evil)
;;; packages/evil.el ends here
#+END_SRC

-----

* UI CONFIGURATIONS
  UI Configurations such as themes, fonts, modeline, dashboard etc..,

** THEMES

#+BEGIN_SRC emacs-lisp :tangle lisp/ui-config.el
;;; ui-config.el --- UI Configurations -*- lexical-binding: t; -*-

;; ----------------------------------------------------------------------------
;; THEMES
;; ----------------------------------------------------------------------------

(use-package ef-themes
  :ensure t
  :config
  (defvar my/current-ef-theme 'ef-winter
    "Stores the current theme to toggle between `ef-cyprus` and `ef-winter`.")

  (defun my/toggle-ef-theme ()
    "Toggle between `ef-cyprus` and `ef-winter` themes."
    (interactive)
    (setq my/current-ef-theme (if (eq my/current-ef-theme 'ef-cyprus)
				  'ef-winter
				'ef-cyprus))
    (ef-themes-select my/current-ef-theme)
    (message "Switched to %s" my/current-ef-theme))

  ;; Load default theme
  (ef-themes-select my/current-ef-theme))


#+END_SRC

** FONTS

#+BEGIN_SRC emacs-lisp :tangle lisp/ui-config.el
;; ----------------------------------------------------------------------------
;; FONT SETTINGS
;; ----------------------------------------------------------------------------

(defvar my/default-font "JetBrainsMono Nerd Font"
  "Default font for Emacs.")

(add-to-list 'default-frame-alist `(font . ,(format "%s-12:bold" my/default-font)))

(set-face-attribute 'default nil
		    :font my/default-font
		    :height 120
		    :weight 'bold)

(set-face-attribute 'fixed-pitch nil
		    :font my/default-font
		    :height 130
		    :weight 'bold)

(set-face-attribute 'variable-pitch nil
		    :font my/default-font
		    :height 120
		    :weight 'bold)


;; Italics for comments & keywords
(set-face-attribute 'font-lock-comment-face nil :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil :slant 'italic)

(setq-default line-spacing 0)

(set-display-table-slot standard-display-table 'truncation (make-glyph-code ?…))
(set-display-table-slot standard-display-table 'wrap (make-glyph-code ?–))


#+END_SRC

** ICONS
All The Icons is an emcas package that provides a collection of icons for use in various Emacs features, such as the mode-line, minibuffer, and other user interfaces.

#+BEGIN_SRC emacs-lisp :tangle lisp/ui-config.el
;; ----------------------------------------------------------------------------
;;; ICONS
;; ----------------------------------------------------------------------------

(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :ensure t
  :defer t
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))

(use-package all-the-icons-completion
  :ensure t
  :defer t
  :hook (marginalia-mode . #'all-the-icons-completion-marginalia-setup)
  :init
  (all-the-icons-completion-mode))

(use-package nerd-icons :defer t
  :custom
  (nerd-icons-color-icons t))


#+END_SRC

