config.org
** BEACON
Whenever the window scrolls a light will shine on top of your cursor so you know where it is - [[https://github.com/Malabarba/beacon][BEACON]].

#+BEGIN_SRC emacs-lisp :tangle lisp/ui-config.el
;;; BEACON

(use-package beacon
  :ensure t
  :defer t
  :init
  ;;(setq beacon-size 40)
  ;;(setq beacon-color "#ff00ff")
  (beacon-mode 1))


(provide 'ui-config)
;;; ui-config.el ends here
#+END_SRC

-----

* DASHBOARD
[[https://github.com/emacs-dashboard/emacs-dashboard][Emacs Dashboard]] is an extensible startup screen showing you recent files, bookmarks, agenda items and an Emacs banner.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/dashboard.el
;;; packages/dashboard.el --- Dashboard Package -*- lexical-binding: t; -*-

;; Load dashboard instead of scratchpad at startup
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

;;(use-package page-break-lines :ensure t) ;; enable if you want horizontal lines between sections in dashboard.

(use-package dashboard
  :ensure t
  :init
  (setq initial-buffer-choice 'dashboard-open)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-display-icons-p t)
  (setq dashboard-icon-type 'nerd-icons)
  (setq dashboard-show-shortcuts nil)
  (setq dashboard-projects-backend 'projectile)
  (setq dashboard-banner-logo-title "I'll Walk My Own Path!")
  ;; (setq dashboard-startup-banner 'logo)
  (setq dashboard-startup-banner "~/.emacs.d/assets/emacs.png")
  (setq dashboard-center-content t)
  (setq dashboard-items '((vocabulary)
			  (recents . 5)
			  (agenda . 5)
			  (bookmarks . 10)
			  (projects . 5)))
  (setq dashboard-startupify-list '(dashboard-insert-banner
				    dashboard-insert-newline
				    dashboard-insert-banner-title
				    dashboard-insert-newline
				    dashboard-insert-init-info
				    dashboard-insert-items))
  (setq dashboard-item-generators '(
				    (vocabulary . gopar/dashboard-insert-vocabulary)
				    (recents . dashboard-insert-recents)
				    (bookmarks . dashboard-insert-bookmarks)
				    (agenda . dashboard-insert-agenda)
				    (projects . dashboard-insert-projects)))
  (defun gopar/dashboard-insert-vocabulary (list-size)
    (dashboard-insert-heading " Word of the Day:"
			      nil
			      (all-the-icons-faicon "newspaper-o"
						    :height 1.2
						    :v-adjust 0.0
						    :face 'dashboard-heading))
    (insert "\n")
    (let ((random-line nil)
	  (lines nil))
      (with-temp-buffer
	(insert-file-contents (concat user-emacs-directory "assets/words"))
	(goto-char (point-min))
	(setq lines (split-string (buffer-string) "\n" t))
	(setq random-line (nth (random (length lines)) lines))
	(setq random-line (string-join (split-string random-line) " ")))
      (insert "    " random-line)))
  :config
  (dashboard-setup-startup-hook)
  (add-hook 'dashboard-mode-hook
	    (lambda ()
	      (display-line-numbers-mode -1))))

(setq dashboard-agenda-tags-format 'ignore)

(setq dashboard-agenda-prefix-format  "%i %s  ")

(setq dashboard-agenda-item-icon "󰸗") ;; Nerd Font calendar icon


(provide 'packages/dashboard)
;;; packages/dashboard.el ends here
#+END_SRC

-----

* MODELINE
The modeline is the bottom status bar that appears in Emacs windows.  While you can create your own custom modeline, why go to the trouble when Doom Emacs already has a nice modeline package available.  For more information on what is available to configure in the Doom modeline, check out: [[https://github.com/seagle0128/doom-modeline][Doom Modeline]]

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/doom-modeline.el
;;; packages/doom-modeline.el --- Doom Modeline Package -*- lexical-binding: t; -*-

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom
  (inhibit-compacting-font-caches t)
  (doom-modeline-buffer-file-name-style 'relative-from-project)
  (doom-modeline-major-mode-icon nil)
  (doom-modeline-minor-modes nil)
  (doom-modeline-buffer-encoding nil)
  (doom-modeline-buffer-state-icon nil)
  (doom-modeline-lsp nil)
  :hook (after-init . doom-modeline-mode)
  :config
    (setq doom-modeline-height 25      ;; sets modeline height
	  doom-modeline-bar-width 5    ;; sets right bar width
	  doom-modeline-persp-name t   ;; adds perspective name to modeline
	  doom-modeline-persp-icon t))


(provide 'packages/doom-modeline)
;;; packages/doom-modeline.el ends here
#+END_SRC

-----

* PROJECTILE
[[https://github.com/bbatsov/projectile][Projectile]] is a project interaction library for Emacs.  It should be noted that many projectile commands do not work if you have set "fish" as the "shell-file-name" for Emacs.  I had initially set "fish" as the "shell-file-name" in the Vterm section of this config, but oddly enough I changed it to "bin/sh" and projectile now works as expected, and Vterm still uses "fish" because my default user "sh" on my Linux system is "fish".

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/projectile.el
;;; packages/projectile.el --- Projectile Package -*- lexical-binding: t; -*-

(use-package projectile
  :ensure t
  :init
  ;; Set the search path for Projectile if the directory exists.
  (when (file-directory-p "/mnt/Karna/Git/Project-K")
    (setq projectile-project-search-path '("/mnt/Karna/Git/Project-K/")))
  ;; Define the action to take when switching projects.
  (setq projectile-switch-project-action #'projectile-dired)
  ;; :custom
  ;; Use Ivy for completion within Projectile.
  ;; (projectile-completion-system 'ivy)
  :config
  ;; Now that Projectile is loaded, append the extra directories to ignore.
  (setq projectile-globally-ignored-directories
	(append projectile-globally-ignored-directories
		'("node_modules" "dist" "build" "vendor" ".venv" "tmp" "cache" "log" "bower_components")))
  (projectile-mode 1))


(provide 'packages/projectile)
;;; packages/projectile.el ends here
#+END_SRC

-----

* PERSPECTIVE
[[https://github.com/nex3/perspective-el][Perspective]] provides multiple named workspaces (or "perspectives") in Emacs, similar to multiple desktops in window managers.  Each perspective has its own buffer list and its own window layout, along with some other isolated niceties, like the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Xref.html][xref]] ring.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/perspective.el
;;; packages/perspective.el --- Perspective Package -*- lexical-binding: t; -*-

(use-package perspective
  :ensure t
  :custom
  ;; NOTE! I have also set 'SCP =' to open the perspective menu.
  ;; I'm only setting the additional binding because setting it
  ;; helps suppress an annoying warning message.
  (persp-mode-prefix-key (kbd "C-c M-p"))
  :config
  (persp-mode 1)
  ;; Sets a file to write to when we save states
)

;; This will group buffers by persp-name in ibuffer.
(add-hook 'ibuffer-hook
	  (lambda ()
	    (persp-ibuffer-set-filter-groups)
	    (unless (eq ibuffer-sorting-mode 'alphabetic)
	      (ibuffer-do-sort-by-alphabetic))))

;; Automatically save perspective states to file when Emacs exits.
;; (add-hook 'kill-emacs-hook #'persp-state-save)

(global-set-key (kbd "C-S-s") #'persp-state-save)


(provide 'packages/perspective)
;;; packages/perspective.el ends here
#+END_SRC

-----

* MINIBUFFER
  Minibuffer settings and packages to make it more effective and productive

** Vertico
Vertico provides an efficient and minimalistic vertical completion UI.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/minibuffer.el
;;; packages/minibuffer.el --- Minibuffer Package -*- lexical-binding: t; -*-

;; ----------------------------------------------------------------------------
;; VERTICO
;; ----------------------------------------------------------------------------

(use-package vertico
  :init
  (vertico-mode)
  :hook
  ;; Tidy paths automatically in the minibuffer.
  (rfn-eshadow-update-overlay-hook . vertico-directory-tidy)
  :config
  ;; Load the directory extension once Vertico is loaded.
  (require 'vertico-directory)
  ;; Show more candidates
  ;(setq vertico-count 20)
  ;; Grow/shrink the minibuffer dynamically.
  (setq vertico-resize nil)
  ;; Enable cycling through candidates.
  (setq vertico-cycle t))


#+END_SRC

** Marginalia
Marginalia enhances minibuffer completions by providing additional context annotations.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/minibuffer.el
;; ----------------------------------------------------------------------------
;; MARGINALIA
;; ----------------------------------------------------------------------------

(use-package marginalia
  :ensure t
  :defer t
  :bind (:map minibuffer-local-map
	 ("M-A" . marginalia-cycle))
  :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init (marginalia-mode))


#+END_SRC

** Embark
Embark allows performing actions on minibuffer candidates dynamically.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/minibuffer.el
;; ----------------------------------------------------------------------------
;; EMBARK
;; ----------------------------------------------------------------------------

(use-package embark
  :ensure t
  :defer t
  :bind (("M-h" . embark-act))
  :commands (embark-act
	       embark-dwim
	       embark-export
	       embark-collect
	       embark-bindings
	       embark-prefix-help-command)

    :init
    (setq prefix-help-command #'embark-prefix-help-command)

    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
		 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
		   nil
		   (window-parameters (mode-line-format . none)))))

  ;;; EMBARK CONSULT

  (use-package embark-consult
     :ensure t
     :after (embark consult)
     :defer t
     :hook
     (embark-collection-mode . consult-preview-at-point-mode))


(provide 'packages/minibuffer)
;;; packages/minibuffer.el ends here
#+END_SRC

** ARCHIVES

*** IVY

#+BEGIN_SRC emacs-lisp :tangle no
;;; IVY

(use-package ivy
  :ensure t
  :bind
  (("C-c C-r" . ivy-resume)
   ("C-x B" . ivy-switch-buffer-other-window))
  :diminish
  :config
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq enable-recursive-minibuffers t)
  (ivy-mode))


#+END_SRC

*** IVY RICH

#+BEGIN_SRC emacs-lisp :tangle no

;;; IVY RICH

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1)  ;; Enable Ivy-rich for improved display in Ivy prompts
  :custom
  (ivy-virtual-abbreviate 'full)  ;; Show full path in Ivy buffers
  (ivy-rich-switch-buffer-align-virtual-buffer t)  ;; Align virtual buffers (e.g., project-root buffers)
  (ivy-rich-path-style 'abbrev)  ;; Abbreviate file paths for better display
  :config
  ;; Set default transformers for ivy commands
  (setq ivy-rich-display-transformers-list
	'((ivy-switch-buffer
	   :columns
	   ((ivy-rich-switch-buffer-icon (:width 2))
	    (ivy-rich-candidate (:width 30))
	    (ivy-rich-switch-buffer-size (:width 7))
	    (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))
	    (ivy-rich-switch-buffer-project (:width 15 :face success))
	    (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))))))


#+END_SRC

*** ALL THE ICONS IVY RICH

#+BEGIN_SRC emacs-lisp :tangle no

;;; ALL THE ICONS IVY RICH

(use-package all-the-icons-ivy-rich
  :ensure t
  :init
  (all-the-icons-ivy-rich-mode 1))


#+END_SRC

*** COUNSEL

#+BEGIN_SRC emacs-lisp :tangle no

;;; COUNSEL

(use-package counsel
  :ensure t
  :after ivy
  :diminish
  :config
  (counsel-mode)
  (setq ivy-initial-inputs-alist nil))

(use-package counsel-projectile
  :ensure t
  :after (projectile counsel)  ;; Ensure Projectile and Counsel are loaded first.
  :config
  (counsel-projectile-mode 1))


#+END_SRC

*** IVY POSTFRAME

#+BEGIN_SRC emacs-lisp :tangle no
;;; IVY POSTFRAME

 (use-package posframe
   :ensure t)

 (use-package ivy-posframe
   :ensure t
   :after ivy
   :config
   (setq ivy-posframe-parameters '((left . 0) (top . 0)))  ;; Center position
   (setq ivy-posframe-width 80)  ;; Adjust the width as needed
   (setq ivy-posframe-height 20)  ;; Adjust the height as needed
   (setq ivy-posframe-min-width 20)

   ;; Enable ivy-posframe
   (ivy-posframe-mode 1))

 (setq ivy-display-function 'ivy-posframe-display)


#+END_SRC

-----

* Consult
The `consult' package provides lots of commands that are enhanced variants of basic, built-in functionality.  One of the headline features of `consult' is its preview facility, where it shows in another Emacs window the context of what is currently matched in the minibuffer.  Here I define key bindings for some commands you may find useful.  The mnemonic for their prefix is "alternative search" (as opposed to the basic C-s or C-r keys).

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/consult.el
;;; packages/consult.el --- Consult Package -*- lexical-binding: t; -*-

(use-package consult
  :ensure t
  :bind (;; A recursive grep
	 ("M-s M-g" . consult-grep)
	 ;; Search for files names recursively
	 ("M-s M-f" . consult-fd)
	 ;; Search through the outline (headings) of the file
	 ("M-s M-o" . consult-outline)
	 ;; Search the current buffer
	 ("M-s M-l" . consult-line)
	 ;; Switch to another buffer, or bookmarked file, or recently
	 ;; opened file.
	 ("M-s M-b" . consult-buffer)))

;;; CONSULT DIR

(use-package consult-dir
 :ensure t
 :defer t
 :bind (("C-x C-d" . consult-dir)
 :map vertico-map
 ("C-x C-d" . consult-dir)
 ("C-x C-j" . consult-dir-jump-file)))

;; The `wgrep' packages lets us edit the results of a grep search
;; while inside a `grep-mode' buffer.  All we need is to toggle the
;; editable mode, make the changes, and then type C-c C-c to confirm
;; or C-c C-k to abort.
;; Further reading: https://protesilaos.com/emacs/dotemacs#h:9a3581df-ab18-4266-815e-2edd7f7e4852

(use-package wgrep
  :ensure t
  :bind ( :map grep-mode-map
	  ("e" . wgrep-change-to-wgrep-mode)
	  ("C-x C-q" . wgrep-change-to-wgrep-mode)
	  ("C-c C-c" . wgrep-finish-edit)))


;; Display a counter showing the number of the current and the other
;; matches.  Place it before the prompt, though it can be after it.
(setq isearch-lazy-count t)
(setq lazy-count-prefix-format "(%s/%s) ")
(setq lazy-count-suffix-format nil)

;; Make regular Isearch interpret the empty space as a regular
;; expression that matches any character between the words you give
;; it.
(setq search-whitespace-regexp ".*?")

(use-package consult-projectile
  :ensure (consult-projectile :type git :host gitlab :repo "OlMon/consult-projectile" :branch "master"))


(provide 'packages/consult)
;; packages/consult.el ends here
#+END_SRC

-----

* COMPLETIONS
  Completion packages such as corfu, cape and some AI packages.

