lisp/ui-config.el

(use-package beacon
  :ensure t
  :defer t
  :init
  ;;(setq beacon-size 40)
  ;;(setq beacon-color "#ff00ff")
  (beacon-mode 1))


(provide 'ui-config)
;;; ui-config.el ends here
