config.org
* ELLAMA
[[https://github.com/s-kostyaev/ellama][Ellama]] is a tool for interacting with large language models from Emacs.  You need to have 'ollama' installed on your computer to use 'ellama' in Emacs.  You need to pull in any LLMs that you want to have available for use.  For example, if you want to be able to use Llama 3.1, then you need to run 'ollama pull llama3.1'.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/ellama.el
;;; packages/ellama.el --- Ellama Package -*- lexical-binding: t; -*-

(use-package ellama
  :init
  (setopt ellama-keymap-prefix "C-c e")  ;; keymap for all ellama functions
  (setopt ellama-language "English")     ;; language ellama should translate to
  (require 'llm-ollama)
  (setopt ellama-provider
    (make-llm-ollama
     ;; this model should be pulled to use it
     ;; value should be the same as you print in terminal during pull
     :chat-model "llama3.1"
     :embedding-model "nomic-embed-text"
     :default-chat-non-standard-params '(("num_ctx" . 8192))))
  ;; Predefined llm providers for interactive switching.
  (setopt ellama-providers
	'(("zephyr" . (make-llm-ollama
	   :chat-model "zephyr"
	   :embedding-model "zephyr"))
	  ("deepseek-r1:8b" . (make-llm-ollama
	   :chat-model "deepseek-r1:8b"
	   :embedding-model "deepseek-r1:8b"))
	  ("llama3" . (make-llm-ollama
	   :chat-model "llama3"
	   :embedding-model "llama3"))
	  ("mistral" . (make-llm-ollama
	    :chat-model "mistral"
	    :embedding-model "mistral"))))
  (setopt ellama-coding-provider
	(make-llm-ollama
	 ;; :chat-model "qwen2.5-coder:3b"
	 :chat-model "deepseek-coder:6.7b"
	 :embedding-model "deepseek-coder:6.7b"
	 ;; :default-chat-non-standard-params '(("num_ctx" . 32768))
))
  (setopt ellama-naming-scheme 'ellama-generate-name-by-llm)
  ;; Translation llm provider
  (setopt ellama-translation-provider (make-llm-ollama
	       :chat-model "qwen2.5:3b"
	       :embedding-model "nomic-embed-text"))
  ;; customize display buffer behaviour
  ;; see ~(info "(elisp) Buffer Display Action Functions")~
  (setopt ellama-chat-display-action-function #'display-buffer-full-frame)
  (setopt ellama-instant-display-action-function #'display-buffer-at-bottom)
  :config
  (setq ellama-sessions-directory "~/.cache/emacs/ellama-sessions/"
	ellama-sessions-auto-save t))


(provide 'packages/ellama)
;; packages/ellama.el ends here
#+END_SRC

-----

* CALC

#+BEGIN_SRC emacs-lisp :tangle lisp/calcc.el
;;; calcc.el --- Calc Package -*- lexical-binding: t; -*-

(use-package calc
  :ensure nil  ;; tells Elpaca not to manage calc because it's built-in
  :bind (("C-x c" . calc)
	 ("C-S-e" . latex-math-from-calc)
	 ("C-c e" . calc-embedded))
  :config
  (use-package calc-embed
    :ensure nil
    :bind (:map calc-override-minor-modes-map
	   ("'" . calc-algebraic-entry)))
  (use-package calc-yank
    :ensure nil
    :defer t
    :config
    (define-advice calc-finish-stack-edit (:around (orig-fn &rest args) pop-to-buffer)
      (cl-letf (((symbol-function 'switch-to-buffer)
		 #'pop-to-buffer))
	(apply orig-fn args))))
  (setq calc-make-windows-dedicated t)
  (defun latex-math-from-calc ()
    "Evaluate `calc' on the contents of line at point."
    (interactive)
    (let ((lang (if (memq major-mode '(org-mode latex-mode LaTeX-mode))
		    'latex 'normal)))
      (cond ((region-active-p)
	     (let* ((beg (region-beginning))
		    (end (region-end))
		    (string (buffer-substring-no-properties beg end)))
	       (kill-region beg end)
	       (insert (calc-eval `(,string calc-language ,lang
					    calc-prefer-frac t
					    calc-angle-mode rad)))))
	    (t (let ((l (thing-at-point 'line)))
		 (end-of-line 1)
		 (kill-line 0)
		 (insert (calc-eval `(,l
				      calc-language ,lang
				      calc-prefer-frac t
				      calc-angle-mode rad)))))))))

;; If you need additional settings for calc after org-latex-preview, combine them into the same declaration:
(use-package calc
  :ensure nil
  :after org-latex-preview
  :hook (calc-mode . my/olp-calc-settings)
  :config
  (defun my/olp-calc-settings ()
    (setq-local org-latex-preview-numbered nil
		org-latex-preview-auto-ignored-commands
		'(mwheel-scroll pixel-scroll-precision
		  scroll-up-command scroll-down-command
		  scroll-other-window scroll-other-window-down))))


(provide 'calcc)
;; calcc.el ends here
#+END_SRC

-----

* FILE MANAGER AND BUFFERS SETUP
I use TREEMACS as file manager with the dired setting and also peep dired for better icons and stuff..

** TREEMACS
Treemacs is a cool alternative to Neotree

#+BEGIN_SRC emacs-lisp :tangle lisp/file-manager.el
;;; file-manager.el --- File Manager Setup -*- lexical-binding: t; -*-

;; ----------------------------------------------------------------------------
;; TREEMACS
;; ----------------------------------------------------------------------------

(use-package treemacs
  :ensure t
  :defer t
  :config
  (setq treemacs-width 30))

(setq treemacs-persist-file (concat user-cache-directory "treemacs-persist"))

;; Mouse single-click expands nodes in Treemacs
(with-eval-after-load 'treemacs
  (define-key treemacs-mode-map [mouse-1] #'treemacs-single-click-expand-action))


#+END_SRC

** DIRED
Enhancing Emacs' built-in Dired file manager with additional functionality.

#+BEGIN_SRC emacs-lisp :tangle lisp/file-manager.el
;; ----------------------------------------------------------------------------
;; DIRED OPEN
;; ----------------------------------------------------------------------------

(use-package dired-open
  :ensure t
  :defer t
  :config
  ;; Define applications to open specific file types
  (setq dired-open-extensions '(("gif" . "sxiv")   ;; Open GIFs with sxiv
				("jpg" . "sxiv")   ;; Open JPEGs with sxiv
				("png" . "sxiv")   ;; Open PNGs with sxiv
				("mkv" . "mpv")    ;; Open MKVs with mpv
				("mp4" . "mpv")))) ;; Open MP4s with mpv

;; Auto Create Directory if it doesn't exist
(advice-add 'read-file-name :around
	    (lambda (orig-fun &rest args)
	      (let ((result (apply orig-fun args)))
		(when (and (stringp result)
			   (not (file-exists-p (file-name-directory result))))
		  (make-directory (file-name-directory result) t))
		result)))


#+END_SRC

** PEEP DIRED
peep-dired: Quick file previews within Dired

#+BEGIN_SRC emacs-lisp :tangle lisp/file-manager.el
;; ----------------------------------------------------------------------------
;; PEEP DIRED
;; ----------------------------------------------------------------------------

(use-package peep-dired
  :after dired
  :ensure t
  :hook (evil-normalize-keymaps . peep-dired-hook) ;; Ensure peep-dired works with Evil mode
  :config
  ;; Define keybindings for navigation in Dired mode
  (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)   ;; Go up one directory
  (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file)      ;; Open file (use `dired-find-file` if not using `dired-open`)

  ;; Keybindings for navigating files in peep-dired preview mode
  (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)  ;; Next file preview
  (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)) ;; Previous file preview


#+END_SRC

** SUDO EDIT
[[https://github.com/nflath/sudo-edit][sudo-edit]] gives us the ability to open files with sudo privileges or switch over to editing with sudo privileges if we initially opened the file without such privileges.

#+BEGIN_SRC emacs-lisp :tangle lisp/file-manager.el
;; ----------------------------------------------------------------------------
;; SUDO EDIT
;; ----------------------------------------------------------------------------

(use-package sudo-edit :ensure t :defer t)


(provide 'file-manager)
;; file-manager.el ends here
#+END_SRC

-----

* DEVELOPMENT
  Development setup using eglot, treesit etc..,

** TREESITTER

#+BEGIN_SRC emacs-lisp :tangle lisp/treesitter.el
;;; treesitter.el --- Treesitter Setup -*- lexical-binding: t; -*-

(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  (c-ts-mode-indent-offset 4)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(use-package treesit
  :ensure nil
  :config
  (setq major-mode-remap-alist
	'((python-mode . python-ts-mode)
	  (javascript-mode . javascript-ts-mode)
	  (typescript-mode . typescript-ts-mode)
	  (json-mode . json-ts-mode)
	  (go-mode . go-ts-mode)
	  (yaml-mode . yaml-ts-mode)
	  (css-mode . css-ts-mode)
	  (html-mode . html-ts-mode)
	  (dockerfile-mode . dockerfile-ts-mode)))

  (setq treesit-language-source-alist
	'((templ      "https://github.com/vrischmann/tree-sitter-templ")
	  (bash       "https://github.com/tree-sitter/tree-sitter-bash")
	  (cmake      "https://github.com/uyha/tree-sitter-cmake")
	  (css        "https://github.com/tree-sitter/tree-sitter-css")
	  (elisp      "https://github.com/Wilfred/tree-sitter-elisp")
	  (go         "https://github.com/tree-sitter/tree-sitter-go")
	  (gomod      "https://github.com/camdencheek/tree-sitter-go-mod")
	  (html       "https://github.com/tree-sitter/tree-sitter-html")
	  (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
	  (cpp        "https://github.com/tree-sitter/tree-sitter-cpp")
	  (dockerfile "https://github.com/camdencheek/tree-sitter-dockerfile")
	  (json       "https://github.com/tree-sitter/tree-sitter-json")
	  (make       "https://github.com/alemuller/tree-sitter-make")
	  (markdown   "https://github.com/ikatyang/tree-sitter-markdown")
	  (python     "https://github.com/tree-sitter/tree-sitter-python")
	  (toml       "https://github.com/tree-sitter/tree-sitter-toml")
	  (tsx        "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
	  (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
	  (yaml       "https://github.com/ikatyang/tree-sitter-yaml")
	  (haskell    "https://github.com/tree-sitter/tree-sitter-haskell")
	  (typst      "https://github.com/uben0/tree-sitter-typst")
	  (java       "https://github.com/tree-sitter/tree-sitter-java")
	  (ruby       "https://github.com/tree-sitter/tree-sitter-ruby")
	  (rust       "https://github.com/tree-sitter/tree-sitter-rust"))))


(provide 'treesitter)
;; treesitter.el ends here
#+END_SRC

