config.org
** CUSTOM LATEX CLASSES
- Adds a custom LaTeX class ("org-plain-latex") for exporting Org documents.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/org-latex.el
;; ------------------------------------------------------------
;; CUSTOM LATEX CLASSES FOR ORG EXPORT
;; ------------------------------------------------------------

(with-eval-after-load 'ox-latex
  (dolist (class
	   '(("IEEEtran" "\\documentclass[conference]{IEEEtran}"
	      ("\\section{%s}" . "\\section*{%s}")
	      ("\\subsection{%s}" . "\\subsection*{%s}")
	      ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	      ("\\paragraph{%s}" . "\\paragraph*{%s}")
	      ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
	     ("article" "\\documentclass[11pt]{article}"
	      ("\\section{%s}" . "\\section*{%s}")
	      ("\\subsection{%s}" . "\\subsection*{%s}")
	      ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	      ("\\paragraph{%s}" . "\\paragraph*{%s}")
	      ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
	     ("report" "\\documentclass[11pt]{report}"
	      ("\\part{%s}" . "\\part*{%s}")
	      ("\\chapter{%s}" . "\\chapter*{%s}")
	      ("\\section{%s}" . "\\section*{%s}")
	      ("\\subsection{%s}" . "\\subsection*{%s}")
	      ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
	     ("book" "\\documentclass[11pt]{book}"
	      ("\\part{%s}" . "\\part*{%s}")
	      ("\\chapter{%s}" . "\\chapter*{%s}")
	      ("\\section{%s}" . "\\section*{%s}")
	      ("\\subsection{%s}" . "\\subsection*{%s}")
	      ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))
	     ("org-plain-latex" "\\documentclass{article}
	       [NO-DEFAULT-PACKAGES]
	       [PACKAGES]
	       [EXTRA]"
	      ("\\section{%s}" . "\\section*{%s}")
	      ("\\subsection{%s}" . "\\subsection*{%s}")
	      ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	      ("\\paragraph{%s}" . "\\paragraph*{%s}")
	      ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
    (add-to-list 'org-latex-classes class)))


#+END_SRC

** ORG LATEX PREVIEW

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/org-latex.el
;; ------------------------------------------------------------
;; ORG LATEX PREVIEW
;; ------------------------------------------------------------

;; Increase LaTeX preview size
(setq org-format-latex-options
      (plist-put org-format-latex-options :scale 2.0)) ;; Adjust as needed

;; Use dvisvgm for SVG-based previews (default)
(setq org-latex-create-formula-image-program 'dvisvgm) ;; Use dvisvgm for better compatibility
(setq org-preview-latex-default-process 'dvisvgm) ;; Default to dvisvgm

(setq org-startup-with-latex-preview t)


;; Prevent navigation commands from triggering LaTeX previews
(setq org-latex-preview-auto-ignored-commands
      '(next-line previous-line mwheel-scroll
	scroll-up-command scroll-down-command))

;; Enable consistent equation numbering
(setq org-latex-preview-numbered t)

;; Enable live previews for real-time LaTeX updates
(setq org-latex-preview-live t)

;; Reduce delay for faster live previews
(setq org-latex-preview-live-debounce 0.25)

;; ;; Stolen from the package ov (Center Previews)

;; (defun ov-at (&optional point)
;;   "Get an overlay at POINT.
;; POINT defaults to the current `point'."
;;   (or point (setq point (point)))
;;   (car (overlays-at point)))
;; ;; https://www.reddit.com/r/emacs/comments/169keg7/comment/jzierha/?utm_source=share&utm_medium=web2x&context=3
;; (defun org-justify-fragment-overlay (beg end image &optional imagetype)
;;   "Only equations at the beginning and also end of a line are justified."
;;   (if
;;    (and (= beg (line-beginning-position)) (= end (line-end-position)))
;;    (let* ((ov (ov-at))
;;   (disp (overlay-get ov 'display)))
;;      (overlay-put ov 'line-prefix `(space :align-to (- center (0.5 . ,disp)))))))
;; (advice-add 'org--make-preview-overlay :after 'org-justify-fragment-overlay)

;; ;; Automatically refresh LaTeX previews on save or edits

;; (add-hook 'org-mode-hook
;;	  (lambda ()
;;	    (add-hook 'after-save-hook 'org-latex-preview nil 'local)
;;	    (add-hook 'after-change-functions
;;		      (lambda (&rest _) (org-latex-preview)) nil 'local)))

#+END_SRC

#+RESULTS:
: 0.25

** CITATION AND BIBLIOGRAPHY INTEGRATION
- Loads citeproc for citation formatting.
- Requires additional citation backends (oc-csl, oc-biblatex, oc-natbib).
- Uncomment and adjust the bibliography path if needed.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/org-latex.el
;; ------------------------------------------------------------
;; CITATION
;; ------------------------------------------------------------

(use-package citeproc
  :ensure t
  :defer t)


(with-eval-after-load 'org
  (require 'oc-csl)
(require 'oc-biblatex)
(require 'oc-natbib))
;; (setq org-cite-global-bibliography '("~/Path/To/bibliographyFile"))


#+END_SRC

** ARCHIVES

*** ORG FRAGTOP
- Automatically toggles LaTeX fragment previews when editing Org files.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/org-latex.el
;;; ORG FRAGTOP

(use-package org-fragtog
  :ensure t
  :defer t)
(add-hook 'org-mode-hook 'org-fragtog-mode)


(provide 'packages/org-latex)
;; packages/org-latex.el ends here
#+END_SRC

-----

* MARKDOWN

** MARKDOWN SETUP
Markdown Preview in both Markdown buffers and Org preview in md formats using browser.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/markdown.el
;;; packages/markdown.el --- Markdown Setup -*- lexical-binding: t; -*-

;;; ============================================================
;;; MARKDOWN SETUP
;;; ============================================================

(use-package markdown-mode
  :ensure t
  :mode ("README\\.md\\'" . gfm-mode))

(eval-after-load "org"
  '(require 'ox-md nil t))

;; -----------------------------------------------------------
;; OX-GFM FOR GITHUB-FLAVORED MARKDOWN EXPORT
;; -----------------------------------------------------------
(use-package ox-gfm
  :ensure t
  :after org
  :defer t)

(autoload 'markdown-mode "markdown-mode"
   "Major mode for editing Markdown files" t)
(add-to-list 'auto-mode-alist
	     '("\\.\\(?:md\\|markdown\\|mkd\\|mdown\\|mkdn\\|mdwn\\)\\'" . markdown-mode))

(autoload 'gfm-mode "markdown-mode"
   "Major mode for editing GitHub Flavored Markdown files" t)
(add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode))


#+END_SRC

** OX-HUGO
OX-HUGO is to convert org files into hugo supported markdown file

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/markdown.el
;; ----------------------------------------------------------------
;; OX-HUGO
;; ----------------------------------------------------------------

(use-package ox-hugo
  :ensure ( :host github
	      :repo "kaushalmodi/ox-hugo"
	      :branch "main")
  :after ox)

;; Function to insert the current date
(defun insert-current-date ()
  "Insert the current date in the format YYYY-MM-DD at the point."
  (interactive)
  (insert (format-time-string "%Y-%m-%d")))

;; Bind the function to C-c d in Org mode
(add-hook 'org-mode-hook
	  (lambda ()
	    (local-set-key (kbd "C-c d") 'insert-current-date)))

;; Function to insert the current time in 24-hour format
(defun insert-current-time ()
  "Insert the current time in the format HH:MM at the point."
  (interactive)
  (insert (format-time-string "%H:%M")))

;; Bind the function to C-c t in Org mode
(add-hook 'org-mode-hook
	  (lambda ()
	    (local-set-key (kbd "C-c t") 'insert-current-time)))



#+END_SRC

** MARKDOWN PREVIEW MODE

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/markdown.el
;; ------------------------------------------------------------
;; MARKDOWN PREVIEW MODE
;; ------------------------------------------------------------

(use-package markdown-preview-mode
  :ensure t
  :commands (markdown-preview-mode
	     markdown-preview-open-browser
	     markdown-preview-cleanup)
  :init
  ;; Set your Markdown processor (by default it uses "markdown")
  ;; If you want to use multimarkdown, make sure it's installed and in your PATH.
  ;(setq markdown-command "multimarkdown")
  :config
  ;; Optional: add extra JavaScript (e.g., MathJax)
  (add-to-list 'markdown-preview-javascript
	       "http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-MML-AM_CHTML"))

;; Additional CSS
;; (setq markdown-preview-stylesheets
;;       (list "http://thomasf.github.io/solarized-css/solarized-light.min.css"))


#+END_SRC

** MARKDOWN LATEX PREVIEW
   Latex preview in Markdown file itsef

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/markdown.el
;; ------------------------------------------------------------
;; MARKDOWN LATEX PREVIEW
;; ------------------------------------------------------------

(use-package preview-tailor
  :ensure t
  :after preview
  :config
  (preview-tailor-init)
  :hook
  (kill-emacs . preview-tailor-save))

;; Preview Latex in markdown buffer as well using a temporary TeX file with preview auto mode.

(defun my-markdown-preview-hook ()
  "Setup LaTeX preview for Markdown mode with a fresh temporary TeX file."
  (setq-local preview-tailor-local-multiplier 0.7)

  ;; Always create a new temporary LaTeX file
  (setq-local my-preview-master (make-temp-file "preview-master" nil ".tex"))
  (with-temp-file my-preview-master
    (insert "\\documentclass{article}\n"
	    "\\usepackage{amsmath, amssymb}\n"
	    "\\begin{document}\n"
	    "% Your LaTeX preview content will be inserted here\n"
	    "\\end{document}\n"))

  (setq-local TeX-master my-preview-master)
  (preview-auto-mode))

(add-hook 'markdown-mode-hook 'my-markdown-preview-hook)


(provide 'packages/markdown)
;; packages/markdown.el ends here
#+END_SRC

** ARCHIVES

** IMPATIENT MODE

#+BEGIN_SRC emacs-lisp :tangle no
;;; IMPATIENT MODE

(use-package impatient-mode
  :ensure t
  :hook (web-mode . impatient-mode))


#+END_SRC

*** CUSTOM FUNCTION FOR MARKDOWN LIVE PREVIEW

#+BEGIN_SRC emacs-lisp :tangle no
;;; MARKDOWN LIVE PREVIEW

;; --------------------------------
;; CUSTOM PACKAGE FOR MARKDOWN PREVIEW FUNCTIONS
;; - This dummy package holds our custom Markdown preview functions.
;; - It is deferred (i.e. not loaded at startup) and provides commands for
;;   live Markdown preview and Org Markdown preview.
;; --------------------------------

(defun markdown-html (buffer)
  "Render Markdown from BUFFER into GitHub-styled HTML with scroll preservation."
  (princ (with-current-buffer buffer
	   (format "<!DOCTYPE html>
<html>
<head>
  <meta charset=\"UTF-8\">
  <script src=\"https://cdnjs.cloudflare.com/ajax/libs/he/1.1.1/he.js\"></script>
  <link rel=\"stylesheet\" href=\"https://assets-cdn.github.com/assets/github-e6bb18b320358b77abe040d2eb46b547.css\">
  <link rel=\"stylesheet\" href=\"https://assets-cdn.github.com/assets/frameworks-95aff0b550d3fe338b645a4deebdcb1b.css\">
  <script type=\"text/javascript\" async src=\"https://polyfill.io/v3/polyfill.min.js?features=es6\"></script>
  <script type=\"text/javascript\" async src=\"https://cdnjs.cloudflare.com/ajax/libs/mathjax/3.2.2/es5/tex-mml-chtml.js\"></script>
  <title>Impatient Markdown</title>
  <script>
    // Restore scroll position on load
    document.addEventListener('DOMContentLoaded', function() {
      var saved = sessionStorage.getItem('imp-scroll');
      if (saved) {
	window.scrollTo(0, parseInt(saved, 10));
      }
      // Observe mutations and try to restore scroll if needed
      new MutationObserver(function() {
	var saved = sessionStorage.getItem('imp-scroll');
	if (saved) { window.scrollTo(0, parseInt(saved, 10)); }
      }).observe(document.body, {childList: true, subtree: true});
    });
    // Save scroll position on scroll
    window.addEventListener('scroll', function() {
      sessionStorage.setItem('imp-scroll', window.pageYOffset);
    });
  </script>
</head>
<body>
  <div id=\"markdown-content\" style=\"display:none\">%s</div>
  <div class=\"markdown-body\" style=\"max-width:968px;margin:0 auto;\"></div>
  <script>
    fetch('https://api.github.com/markdown', {
      method: 'POST',
      headers: { 'Content-Type': 'application/json' },
      body: JSON.stringify({ \"text\": document.getElementById('markdown-content').innerHTML, \"mode\": \"gfm\", \"context\": \"knit-pk/homepage-nuxtjs\" })
    }).then(response => response.text()).then(response => {
      document.querySelector('.markdown-body').innerHTML = he.decode(response);
      MathJax.typesetPromise();
    }).then(() => {
      fetch(\"https://gist.githubusercontent.com/FieryCod/b6938b29531b6ec72de25c76fa978b2c/raw/\")
      .then(response => response.text()).then(eval);
    });
  </script>
</body>
</html>"
		   (buffer-substring-no-properties (point-min) (point-max))))
	 (current-buffer)))


(defun markdown-preview-auto ()
  "Start HTTP server, enable `impatient-mode`, set user filter to `markdown-html`, and open preview."
  (interactive)
  ;; Start the HTTP server if not already running
  (unless (process-status "httpd")
    (httpd-start))
  ;; Enable impatient mode
  (impatient-mode 1)
  ;; Set the user filter function to render Markdown like GitHub
  (setq imp-user-filter #'markdown-html)
  ;; Refresh the impatient mode state
  (cl-incf imp-last-state)
  (imp--notify-clients)
  ;; Open the preview in the browser
  (browse-url "http://localhost:8080/imp"))


#+END_SRC

-----

* ORG MODE
This configuration sets up Org Agenda, auto-tangling, visual enhancements (bullets, centering, fonts), definitions, and advanced features such as Org Roam, Org-Tempo, and more. This also contains some of the programming modes using org mode such as latex and markdown.

** SETTINGS
Some settings that will make the UI look and feel more appealing(Personal) and also enhancing features in org mode.

*** TOC & INDENTATION
Allows us to create a Table of Contents in our Org docs. And also preserving Indentation on Org Bable Tangle

#+BEGIN_SRC emacs-lisp :tangle lisp/org-config.el
;;; org-config.el --- Org Config -*- lexical-binding: t; -*-

;; ------------------------------------------------
;; TOC & INDENTATION
;; ------------------------------------------------

(use-package toc-org
    :ensure t
    :defer t
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))

(setq org-src-preserve-indentation t
      org-src-fontify-nativelt t
      org-src-window-setup 'current-window
      org-edit-src-content-indentation 0
      org-src-tab-acts-natively t)

;; Prevent '<>' from auto-pairing in Org mode (fix for org-tempo)
(add-hook 'org-mode-hook
	  (lambda ()
	    (setq-local electric-pair-inhibit-predicate
			`(lambda (c)
			   (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

(eval-after-load 'org-indent '(diminish 'org-indent-mode)) ;; Removes "Ind" from showing in the modeline.
(setq org-insert-heading-respect-content t) ;; M-RET will enter heading after the text w.r.t the previous heading


#+END_SRC

