lisp/org-config.el
;;; org-config.el --- Org Config -*- lexical-binding: t; -*-

;; ------------------------------------------------
;; TOC & INDENTATION
;; ------------------------------------------------

(use-package toc-org
    :ensure t
    :defer t
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))

(setq org-src-preserve-indentation t
      org-src-fontify-nativelt t
      org-src-window-setup 'current-window
      org-edit-src-content-indentation 0
      org-src-tab-acts-natively t)

;; Prevent '<>' from auto-pairing in Org mode (fix for org-tempo)
(add-hook 'org-mode-hook
	  (lambda ()
	    (setq-local electric-pair-inhibit-predicate
			`(lambda (c)
			   (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

(eval-after-load 'org-indent '(diminish 'org-indent-mode)) ;; Removes "Ind" from showing in the modeline.

;; ------------------------------------------------
;;; ORG UI SETTINGS
;; ------------------------------------------------
