config.el
;;; ORG TEMPO

(require 'org-tempo)
