config.org
*** Org Mode Core Settings
This section sets up basic Org mode options such as the Org directory, default notes file, ellipsis, heading bullets, log settings, link abbreviations, table conversion limits, and todo keywords.

#+BEGIN_SRC emacs-lisp :tangle lisp/org-config.el
;; ------------------------------------------------
;; ORG MODE CORE SETTINGS
;; ------------------------------------------------

(setq org-directory "/mnt/Karna/Git/Project-K/Org/"
      org-default-notes-file (expand-file-name "notes.org" org-directory)
      org-ellipsis " ⬎ "
      org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
      org-superstar-itembullet-alist '((?+ . ?➤) (?- . ?✦)) ; changes +/- symbols in item lists
      org-hide-emphasis-markers t
      ;; ex. of org-link-abbrev-alist in action
      ;; [[arch-wiki:Name_of_Page][Description]]
      org-link-abbrev-alist
	'(("google" . "http://www.google.com/search?q=")
	  ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
	  ("ddg" . "https://duckduckgo.com/?q=")
	  ("wiki" . "https://en.wikipedia.org/wiki/"))
      org-table-convert-region-max-lines 20000)


(setq org-todo-keywords
      '((sequence "IDEA(i)"      ; Generate research ideas
		  "LIT(l)"       ; Conduct literature review
		  "CODE(c)"      ; Develop code/algorithms
		  "TEST(t)"      ; Test implementations or experiments
		  "WRITE(w)"     ; Document findings or draft manuscripts
		  "REVIEW(r)"    ; Revise based on feedback
		  "|"
		  "SUBMITTED(s)" ; Work submitted for review/publication
		  "PUBLISHED(p)" ; Work published (or defended)
		  "ABANDONED(x)") ; Project discontinued
	(sequence "TODO(T)"       ; Basic task: not yet started
		  "NEXT(n)"       ; Basic task: immediate next action
		  "|"
		  "DONE(d!)"))) ; Basic task: completed

;; --------------------------------------------------
;; ORG EXPORT
;; --------------------------------------------------

(setq org-export-backends '(md org ascii html icalendar latex odt)
      org-export-with-toc nil)

;; Load export backends
(require 'ox-md)
(require 'ox-org)


#+END_SRC

*** Org Refiler Settings
This section configures the refile targets and ensures that Org buffers are saved after refile operations.

#+BEGIN_SRC emacs-lisp :tangle lisp/org-config.el
;; ------------------------------------------------
;; ORG REFILE SETTINGS
;; ------------------------------------------------

(setq org-bookmark-names-plist nil) ;; Stop bookmarking on org captures and refiling

(setq org-refile-targets
      '(("Tasks.org" :maxlevel . 1)))

(setq org-hide-drawers '("PROPERTIES"))

;; Save Org buffers after refiling!
(advice-add 'org-refile :after 'org-save-all-org-buffers)


(provide 'org-config)
;; org-config.el ends here
#+END_SRC

** AGENDA
This section configures Org Agenda by specifying agenda files, enabling log mode, setting logging behavior, and customizing agenda views.

#+BEGIN_SRC emacs-lisp :tangle lisp/org-agenda-config.el
;;; org-agenda-config.el --- ORG Agenda Config -*- lexical-binding: t; -*-

(require 'org-habit)

(use-package org-super-agenda
  :ensure t
  :config
  (setq org-super-agenda-groups
	'((:name "🔥 Urgent" :priority "A" :order 1) ; High-priority tasks
	  (:name "📅 Today" :time-grid t :order 2) ; Tasks for today
	  (:name "📚 Research" :tag "research" :order 3) ; Research group
	  (:name "📖 Study" :tag "study" :order 4) ; Study tasks
	  (:name "🏡 Home" :tag "home" :order 5) ; Home tasks
	  (:name "🔔 Remainder" :tag "remainder" :order 6) ; Remainders
	  (:name "💪 Gym" :tag "gym" :order 7) ; Gym/habits
	  (:name "❌ Quit" :tag "quit" :order 99) ; Abandoned tasks
	  (:name "Other" :auto-group t :order 100))) ; Catch-all group

  (setq org-tag-alist
	'((:startgroup)
	  ("study"    . ?s) ; Study tasks
	  ("home"     . ?h) ; Home tasks
	  ("remainder". ?r) ; Remainders
	  ("gym"      . ?g) ; Gym/habits
	  ("research" . ?R) ; Research tasks
	  (:endgroup)
	  ("litreview" . ?l) ; Literature review (sub-step of research)
	  ("experiment". ?e) ; Experiments (sub-step of research)
	  ("writing"   . ?w) ; Writing (sub-step of research)
	  ("quit" . ?x))) ; Abandoned tasks

  (org-super-agenda-mode))

(advice-add 'org-agenda-todo :after #'org-save-all-org-buffers)

(setq org-agenda-files (directory-files-recursively org-directory "\\.org$") )
(setq org-agenda-start-on-weekday nil) ; - to see from current day instead of from Monday
(setq org-agenda-start-day "-1d") ; - that's only for seeing week from yesterday, not from today

(setq org-agenda-start-with-log-mode t
      org-log-done 'time
      org-log-into-drawer t)

;; Fancy Priorities Settings
(setq org-fancy-priorities-list '("🟥" "🟧" "🟨")
      org-priority-faces
      '((?A :foreground "#ff6c6b" :weight bold)  ; High priority (🟥)
	(?B :foreground "#98be65" :weight bold)  ; Medium priority (🟧)
	(?C :foreground "#c678dd" :weight bold)) ; Low priority (🟨)
      org-agenda-block-separator 8411)

;; Org Agenda Custom Commands
(setq org-agenda-custom-commands
      '(
	;; Dashboard: Agenda view + Next Tasks + Active Projects
	("d" "Dashboard"
	 ((agenda "" ((org-deadline-warning-days 7)))
	  (todo "NEXT" ((org-agenda-overriding-header "Next Tasks")))
	  (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

	;; Next Tasks: Focused view on tasks marked as NEXT
	("n" "Next Tasks"
	 ((todo "NEXT" ((org-agenda-overriding-header "Next Tasks")))))

	;; Work & Location-Based Tasks: Filter tasks by location tags
	("w" "Work & Location Tasks"
	 ((tags-todo "+@lab")
	  (tags-todo "+@office")
	  (tags-todo "+@errand")
	  (tags-todo "+@home")))

	;; Low-Effort Tasks: Show NEXT tasks with low estimated effort
	("e" "Low-Effort Tasks"
	 ((tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
		     ((org-agenda-overriding-header "Low Effort Tasks")
		      (org-agenda-max-todos 20)
		      (org-agenda-files org-agenda-files)))))

	;; Unified Research Workflow
	("r" "Unified Research Workflow"
	 ((todo "IDEA"      ((org-agenda-overriding-header "Research Ideas")))
	  (todo "LIT"       ((org-agenda-overriding-header "Literature Review")))
	  (todo "CODE"      ((org-agenda-overriding-header "Development / Coding")))
	  (todo "TEST"      ((org-agenda-overriding-header "Testing / Experiments")))
	  (todo "WRITE"     ((org-agenda-overriding-header "Writing / Documentation")))
	  (todo "REVIEW"    ((org-agenda-overriding-header "Revision / Feedback")))
	  (todo "SUBMITTED" ((org-agenda-overriding-header "Submitted Work")))
	  (todo "PUBLISHED" ((org-agenda-overriding-header "Published Work")))
	  (todo "ABANDONED" ((org-agenda-overriding-header "Discontinued Projects")))))

	;; Priority-Based View: Unfinished tasks by custom priority tags
	("v" "Priority View"
	 ((tags "PRIORITY=\"A\""
		((org-agenda-skip-function
		  '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "High-Priority Tasks")))
	  (tags "PRIORITY=\"B\""
		((org-agenda-skip-function
		  '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "Medium-Priority Tasks")))
	  (tags "PRIORITY=\"C\""
		((org-agenda-skip-function
		  '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "Low-Priority Tasks")))
	  (agenda "")
	  (alltodo "")))))


(provide 'org-agenda-config)
;; org-agenda-config.el ends here
#+END_SRC

** ORG ROAM & JOURNAL CONFIGURATION
This section sets up Org Roam for advanced note-taking and integrates Org Journal and dailies. The configuration includes custom capture templates for different note types.

