config.org
** VTERM MULTI

#+BEGIN_SRC emacs-lisp :tangle lisp/shells.el
;; -------------------------------------------------------------------------
;; VTERM MULTI
;; -------------------------------------------------------------------------

(use-package multi-vterm
	:config
	(add-hook 'vterm-mode-hook
			(lambda ()
			(setq-local evil-insert-state-cursor 'box)
			(evil-insert-state)))
	(define-key vterm-mode-map [return]                      #'vterm-send-return)

	(setq vterm-keymap-exceptions nil)
	(evil-define-key 'insert vterm-mode-map (kbd "C-e")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-f")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-a")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-v")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-b")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-w")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-u")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-n")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-m")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-p")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-j")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-k")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-r")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-t")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-g")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-c")      #'vterm--self-insert)
	(evil-define-key 'insert vterm-mode-map (kbd "C-SPC")    #'vterm--self-insert)
	(evil-define-key 'normal vterm-mode-map (kbd "C-d")      #'vterm--self-insert)
	(evil-define-key 'normal vterm-mode-map (kbd ",c")       #'multi-vterm)
	(evil-define-key 'normal vterm-mode-map (kbd ",n")       #'multi-vterm-next)
	(evil-define-key 'normal vterm-mode-map (kbd ",p")       #'multi-vterm-prev)
	(evil-define-key 'normal vterm-mode-map (kbd "i")        #'evil-insert-resume)
	(evil-define-key 'normal vterm-mode-map (kbd "o")        #'evil-insert-resume)
	(evil-define-key 'normal vterm-mode-map (kbd "<return>") #'evil-insert-resume))


(provide 'shells)
;; shells.el ends here
#+END_SRC

-----

* CALENDAR
Let’s make a 12-month calendar available so we can have a calendar app that, we get a nice 12-month calendar to view.
This is a modification of: http://homepage3.nifty.com/oatu/emacs/calendar.html
  See also: https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months - Copied from DISTROTUBE

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/calendar.el
;;; packages/calendar.el --- Calendar Package -*- lexical-binding: t; -*-

;; https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months

(use-package calfw :ensure t :defer t)
(use-package calfw-org :ensure t :defer t)
;;(use-package calendar)

(defun karna/year-calendar (&optional year)
  (interactive)
  (require 'calendar)
  (let* (
      (current-year (number-to-string (nth 5 (decode-time (current-time)))))
      (month 0)
      (year (if year year (string-to-number (format-time-string "%Y" (current-time))))))
    (switch-to-buffer (get-buffer-create calendar-buffer))
    (when (not (eq major-mode 'calendar-mode))
      (calendar-mode))
    (setq displayed-month month)
    (setq displayed-year year)
    (setq buffer-read-only nil)
    (erase-buffer)
    ;; horizontal rows
    (dotimes (j 4)
      ;; vertical columns
      (dotimes (i 3)
	(calendar-generate-month
	  (setq month (+ month 1))
	  year
	  ;; indentation / spacing between months
	  (+ 5 (* 25 i))))
      (goto-char (point-max))
      (insert (make-string (- 10 (count-lines (point-min) (point-max))) ?\n))
      (widen)
      (goto-char (point-max))
      (narrow-to-region (point-max) (point-max)))
    (widen)
    (goto-char (point-min))
    (setq buffer-read-only t)))

(defun karna/scroll-year-calendar-forward (&optional arg event)
  "Scroll the yearly calendar by year in a forward direction."
  (interactive (list (prefix-numeric-value current-prefix-arg)
		     last-nonmenu-event))
  (unless arg (setq arg 0))
  (save-selected-window
    (if (setq event (event-start event)) (select-window (posn-window event)))
    (unless (zerop arg)
      (let* (
	      (year (+ displayed-year arg)))
	(karna/year-calendar year)))
    (goto-char (point-min))
    (run-hooks 'calendar-move-hook)))

(defun karna/scroll-year-calendar-backward (&optional arg event)
  "Scroll the yearly calendar by year in a backward direction."
  (interactive (list (prefix-numeric-value current-prefix-arg)
		     last-nonmenu-event))
  (karna/scroll-year-calendar-forward (- (or arg 1)) event))

(defalias 'year-calendar 'karna/year-calendar)


(provide 'packages/calendar)
;; packages/calendar.el ends here
#+END_SRC

-----

* CENTAUR TABS
[[https://github.com/ema2159/centaur-tabs][Centaur Tabs]] is an Emacs package that enhances the tab bar functionality, providing a more visually appealing and user-friendly way to manage multiple open buffers (files) within the editor.

#+BEGIN_SRC emacs-lisp :tangle lisp/packages/centaur-tabs.el
;;; packages/centaur-tabs.el --- Centaur Tabs Package -*- lexical-binding: t; -*-

(use-package centaur-tabs
  :init
  (setq centaur-tabs-enable-key-bindings t)

:config
;; Appearance settings
(setq centaur-tabs-style "bar"
      centaur-tabs-height 25
      centaur-tabs-set-icons t
      centaur-tabs-show-new-tab-button t
      centaur-tabs-set-modified-marker t
      centaur-tabs-modified-marker "•"
      centaur-tabs-show-navigation-buttons t
      centaur-tabs-set-bar 'over
      centaur-tabs-show-count nil
      centaur-tabs-label-fixed-length 15
      centaur-tabs-gray-out-icons 'buffer
      x-underline-at-descent-line t
      centaur-tabs-left-edge-margin nil)

;; Hide specific buffers
(setq centaur-tab-buffer-local-list '(("\*scratch\*" :hide t)
				      ("\*Warnings\*" :hide t)
				      ("\*straight-process\*" :hide t)
				      ("\*Messages\*" :hide t)
				      ("Tasks.org" :hide t)))

;; Font and style adjustments
(centaur-tabs-change-fonts (face-attribute 'default :font) 110)
(centaur-tabs-headline-match)

;; Buffer naming behavior
(setq uniquify-separator "/"
      uniquify-buffer-name-style 'forward)

;; Custom buffer grouping
(defun my/centaur-tabs-buffer-groups ()
  "Define custom buffer groups for Centaur Tabs."
  (list
   (cond
    ((or (string-equal "*" (substring (buffer-name) 0 1))
	 (memq major-mode '(magit-process-mode
			    magit-status-mode
			    magit-diff-mode
			    magit-log-mode
			    magit-file-mode
			    magit-blob-mode
			    magit-blame-mode)))
     "Emacs")
    ((derived-mode-p 'prog-mode)
     "Editing")
    ((derived-mode-p 'dired-mode)
     "Dired")
    ((memq major-mode '(helpful-mode
			help-mode))
     "Help")
    ((memq major-mode '(org-mode
			org-agenda-clockreport-mode
			org-src-mode
			org-agenda-mode
			org-beamer-mode
			org-indent-mode
			org-bullets-mode
			org-cdlatex-mode
			org-agenda-log-mode
			diary-mode))
     "OrgMode")
    ;; ((member (buffer-name) '("*scratch*" "*Messages*" "*dashboard*" "*eww*")) "All")
    ((string-equal "newsrc-dribble" (buffer-name)) "Others")
    ((derived-mode-p 'gnus-mode) "All")
    ((eq major-mode 'message-mode) "All")
    ((string-match "org.*sidebar" (buffer-name)) "Others")
    ((string-match "<tree>" (buffer-name)) "Others")
    ((string-match "^TAGS.*" (buffer-name)) "Others")
    ((eq major-mode 'dired-mode) "Dired")
    (t "All"))))
(setq centaur-tabs-buffer-groups-function #'my/centaur-tabs-buffer-groups)

;; Enable centaur-tabs-mode
(centaur-tabs-mode t)

;; Keybindings
:bind
("C-<prior>" . centaur-tabs-backward)
("C-<next>" . centaur-tabs-forward)
("C-S-<prior>" . centaur-tabs-move-current-tab-to-left)
("C-S-<next>" . centaur-tabs-move-current-tab-to-right)
(:map evil-normal-state-map
      ("g t" . centaur-tabs-forward)
      ("g T" . centaur-tabs-backward))

;; Hooks
:hook
(dashboard-mode . centaur-tabs-local-mode)
(term-mode . centaur-tabs-local-mode)
(calendar-mode . centaur-tabs-local-mode)
(org-agenda-mode . centaur-tabs-local-mode))

;; Custom tab switching function
(defun my/switch-tabs (&optional direction cycle-group)
  "Change tabs in the given direction (left or right). Cycle within the same group unless cycle-group is non-nil."
  (interactive)
  (let* ((keys (mapcar #'event-basic-type (this-command-keys-vector)))
	 (direction (or direction (if (or (member 'left keys) (member 'home keys)) 'left 'right)))
	 (centaur-tabs-cycle-scope (if cycle-group 'groups (if (> (length keys) 1) 'groups 'tabs))))
    (if (eq window-system 'mac)
	(mac-start-animation (selected-window) :type 'swipe :direction direction))
    (centaur-tabs-cycle (eq direction 'left))))

;; Keybindings for tab switching
(keymap-global-set "C-M-<right>" #'my/switch-tabs)
(keymap-global-set "C-M-<left>" #'my/switch-tabs)


(provide 'packages/centaur-tabs)
;; packages/centaur-tabs.el ends here
#+END_SRC

-----

